## Importing Libraries

In [142]:
import os
import numpy as np
import pandas as pd
from pyzipcode import ZipCodeDatabase
import matplotlib.pyplot as plt
import seaborn as sns
from scipy import stats
%matplotlib inline

## Path Defination and Data Importation

In [143]:
LOCALPATH = os.path.join(os.getcwd(),"..")
DATAPATH = os.path.join(LOCALPATH,"data")
RAWDATA = os.path.join(DATAPATH,"Raw_data")
INCOME_PATH = os.path.join(RAWDATA, "kaggle_income.csv")
Income_df = pd.read_csv(INCOME_PATH, encoding='latin-1')
Income_df.head()

,id,State_Code,State_Name,State_ab,County,City,Place,Type,Primary,Zip_Code,Area_Code,ALand,AWater,Lat,Lon,Mean,Median,Stdev,sum_w
0,1011000,1,Alabama,AL,Mobile County,Chickasaw,Chickasaw city,City,place,36611,251,10894952,909156,30.771450,-88.079697,38773,30506,33101,1638.260513
1,1011010,1,Alabama,AL,Barbour County,Louisville,Clio city,City,place,36048,334,26070325,23254,31.708516,-85.611039,37725,19528,43789,258.017685
2,1011020,1,Alabama,AL,Shelby County,Columbiana,Columbiana city,City,place,35051,205,44835274,261034,33.191452,-86.615618,54606,31930,57348,926.031000
3,1011030,1,Alabama,AL,Mobile County,Satsuma,Creola city,City,place,36572,251,36878729,2374530,30.874343,-88.009442,63919,52814,47707,378.114619
4,1011040,1,Alabama,AL,Mobile County,Dauphin Island,Dauphin Island,Town,place,36528,251,16204185,413605152,30.250913,-88.171268,77948,67225,54270,282.320328

In [144]:
mean_income_df = Income_df[['Mean','Median','Stdev','City','State_ab']].groupby(['City','State_ab'], as_index=False).mean()
mean_income_df = mean_income_df.rename(columns={'State_ab':'State'})
mean_income_df.head()

         City State          Mean        Median         Stdev
0   Abbeville    AL  40518.000000  25216.000000  39126.000000
1   Abbeville    LA  30647.000000  25628.333333  21177.666667
2   Abbeville    SC  45585.666667  32245.000000  41647.333333
3  Abbotsford    WI  58254.000000  44919.000000  48933.000000
4    Aberdeen    MD  96480.000000  80370.000000  64102.000000

In [145]:
mean_income_df.shape

(11228, 5)

In [146]:
tot_df.shape

(2995, 37)

In [147]:
total_df = mean_income_df.merge(total_df, on=['City','State'])
total_df.shape

(1374, 32)

In [148]:
LOCALPATH = os.path.join(os.getcwd(),"..")
DATAPATH = os.path.join(LOCALPATH,"City_Search_Data")
POP_PATH = os.path.join(DATAPATH,"Population_df.csv")
DIV_PATH = os.path.join(DATAPATH,"Diversity_df.csv")
POV_PATH = os.path.join(DATAPATH,'Poverty_df.csv')
EMPLOYMENT_PATH = os.path.join(DATAPATH,'Employment_df.csv')
EMPLOYMENT_RATIO_PATH = os.path.join(DATAPATH,"Employment_ratio_df.csv")
INDUSTRY_PATH = os.path.join(DATAPATH,"Industry_df.csv")
TRANSPORT_PATH = os.path.join(DATAPATH,"Transportation_df.csv")
INCOME_PATH = os.path.join(DATAPATH,"Mean_Income_df.csv")
TOTAL_SEARCH_PATH = os.path.join(DATAPATH, "Total_Search_df.csv")
RECOMMENPATH = os.path.join(DATAPATH, "Recommendation_df.csv")

In [149]:
tot_ser_df = pd.read_csv(TOTAL_SEARCH_PATH, index_col ='index')
pop_df = pd.read_csv(POP_PATH, index_col='index')
pov_df = pd.read_csv(POV_PATH)
div_df = pd.read_csv(DIV_PATH)
inc_df = pd.read_csv(INCOME_PATH)
rec_df = pd.read_csv(RECOMMENPATH)
ind_df = pd.read_csv(INDUSTRY_PATH)
tra_df = pd.read_csv(TRANSPORT_PATH)
emp_df = pd.read_csv(EMPLOYMENT_PATH)
emp_r_df = pd.read_csv(EMPLOYMENT_RATIO_PATH)

In [150]:
tot_ser_df.head()

,City,State,population,minimum_age_x,minimum_age_y,Hispanic,White,Black,Native,Asian,...,PublicWork,SelfEmployed,FamilyWork,Income,IncomeErr,IncomePerCap,IncomePerCapErr,Mean,Median,Stdev
index,,,,,,,,,,,,,,,,,,,,,
19,Aberdeen,WA,1029028,0.0,80.0,9.6,80.1,1.1,4.0,1.5,...,21.7,7.0,0.2,43538.0,1652.0,22387.0,757.0,72647.000000,80209.000000,46242.000000
24,Abilene,TX,5365712,0.0,80.0,23.2,65.6,7.2,0.4,1.7,...,16.5,5.7,0.2,45396.0,1528.0,23896.0,744.0,51258.923077,79425.538462,38462.769231
26,Abingdon,MD,1299364,0.0,80.0,4.0,77.6,12.9,0.2,2.8,...,21.2,4.2,0.2,80465.0,1153.0,35746.0,520.0,109797.000000,300000.000000,57646.500000
27,Abingdon,VA,1152008,0.0,80.0,1.4,95.6,1.4,0.0,0.6,...,15.9,6.0,0.0,43310.0,1910.0,25351.0,968.0,60952.500000,47182.500000,54058.000000
109,Adena,OH,94556,0.0,80.0,0.8,93.2,3.8,0.2,0.4,...,13.9,3.8,0.1,43833.0,1491.0,23684.0,711.0,51340.500000,48046.500000,37181.500000

In [151]:
pop_df.head()

             City State  population  minimum_age_x  minimum_age_y
index
0      Aaronsburg    PA       52888            0.0           80.0
1       Abbeville    AL      289564            0.0           80.0
2       Abbeville    GA      208956            0.0           80.0
3       Abbeville    LA     1092520            0.0           80.0
4       Abbeville    MS      103532            0.0           80.0

In [152]:
pov_df.head()

        City State  Poverty  ChildPoverty
0   Aberdeen    WA     18.1          24.8
1    Abilene    TX     17.4          21.6
2   Abingdon    MD      8.0          11.7
3   Abingdon    VA     12.8          17.1
4  Adams Run    SC     13.1          18.4

In [153]:
ind_df.head()

        City State  Professional  Service  Office  Construction  Production
0   Aberdeen    WA          25.0     24.9    23.1          11.8        15.1
1    Abilene    TX          30.3     21.9    25.8          11.1        10.9
2   Abingdon    MD          42.4     14.7    25.0           8.6         9.3
3   Abingdon    VA          34.4     17.1    24.8           7.3        16.4
4  Adams Run    SC          34.5     16.7    26.1          10.5        12.3

In [154]:
tra_df.head()

,City,State,Drive,Carpool,Transit,Walk,OtherTransp,WorkAtHome,MeanCommute
0,Aberdeen,WA,76.9,13.4,1.5,2.2,2.0,3.9,24.2
1,Abilene,TX,81.4,11.4,0.6,2.3,1.8,2.5,15.9
2,Abingdon,MD,83.2,9.1,1.7,1.4,0.8,3.9,31.7
3,Abingdon,VA,84.2,8.8,0.3,1.8,0.6,4.2,23.2
4,Adams Run,SC,83.6,9.9,0.6,0.9,1.2,3.8,28.2

In [155]:
emp_r_df.head()

        City State  PrivateWork  PublicWork  SelfEmployed  FamilyWork
0   Aberdeen    WA         71.2        21.7           7.0         0.2
1    Abilene    TX         77.5        16.5           5.7         0.2
2   Abingdon    MD         74.4        21.2           4.2         0.2
3   Abingdon    VA         78.1        15.9           6.0         0.0
4  Adams Run    SC         77.0        18.3           4.5         0.2

### Recommendation Data

In [159]:
LOCALPATH = os.path.join(os.getcwd(),"..")
DATAPATH = os.path.join(LOCALPATH,"City_Search_Data")
RECOM_PATH = os.path.join(DATAPATH,"Recommendation_df.csv")
recom_df = pd.read_csv(RECOM_PATH)
total_df.head()

,City,State,Mean_x,Median_x,Stdev_x,Mean_y,Median_y,Stdev_y,population,Poverty,...,WorkAtHome,MeanCommute,PrivateWork,PublicWork,SelfEmployed,FamilyWork,Income,IncomeErr,IncomePerCap,IncomePerCapErr
0,Aberdeen,WA,72647.000000,80209.000000,46242.000000,72647.000000,80209.000000,46242.000000,1029028,67.7,...,690,20,2480,180,115,2302,1550,1638,1708,1638
1,Abilene,TX,51258.923077,79425.538462,38462.769231,51258.923077,79425.538462,38462.769231,5365712,60.6,...,1739,2523,1528,2025,1637,1000,1708,783,565,783
2,Abingdon,MD,109797.000000,300000.000000,57646.500000,109797.000000,300000.000000,57646.500000,1299364,31.4,...,1000,871,714,2506,2257,489,565,1915,1552,135
3,Abingdon,VA,60952.500000,47182.500000,54058.000000,60952.500000,47182.500000,54058.000000,1152008,47.0,...,115,2975,1390,1782,823,2535,631,1074,1523,2177
4,Adena,OH,51340.500000,48046.500000,37181.500000,51340.500000,48046.500000,37181.500000,94556,57.6,...,2019,2168,1951,1037,2726,495,1184,905,190,382

In [161]:
City_State_df = total_df[['City','State']]
Number_df = total_df.drop(['City',
'State'], axis = 1)
Number_df.head()

,Mean_x,Median_x,Stdev_x,Mean_y,Median_y,Stdev_y,population,Poverty,Diversity,Employment,...,WorkAtHome,MeanCommute,PrivateWork,PublicWork,SelfEmployed,FamilyWork,Income,IncomeErr,IncomePerCap,IncomePerCapErr
0,72647.000000,80209.000000,46242.000000,72647.000000,80209.000000,46242.000000,1029028,67.7,5060.57,1593338.16,...,690,20,2480,180,115,2302,1550,1638,1708,1638
1,51258.923077,79425.538462,38462.769231,51258.923077,79425.538462,38462.769231,5365712,60.6,4511.59,3691277.68,...,1739,2523,1528,2025,1637,1000,1708,783,565,783
2,109797.000000,300000.000000,57646.500000,109797.000000,300000.000000,57646.500000,1299364,31.4,4966.20,7738510.08,...,1000,871,714,2506,2257,489,565,1915,1552,135
3,60952.500000,47182.500000,54058.000000,60952.500000,47182.500000,54058.000000,1152008,47.0,5841.56,1486344.08,...,115,2975,1390,1782,823,2535,631,1074,1523,2177
4,51340.500000,48046.500000,37181.500000,51340.500000,48046.500000,37181.500000,94556,57.6,5716.26,1807795.60,...,2019,2168,1951,1037,2726,495,1184,905,190,382